---
kind: method
id: M:Autodesk.Revit.DB.Macros.VendorIdAttribute.#ctor(System.String)
source: html/aee13d3f-8932-f2c8-ffc3-7ef4c626b964.htm
---
# Autodesk.Revit.DB.Macros.VendorIdAttribute.#ctor Method

Constructs a new VendorIdAttribute.

## Syntax (C#)
```csharp
public VendorIdAttribute(
	string vendorIdStr
)
```

## Parameters
- **vendorIdStr** (`System.String`)